Revit 2027 API
BuiltInFailures.ColumnInsideWallFailures Class
 Failures description ColumnInsideWall
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ColumnInsideWallFailures
Public NotInheritable Class ColumnInsideWallFailures
public ref class ColumnInsideWallFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ColumnInsideWallFailures = class end
The BuiltInFailures.ColumnInsideWallFailures type exposes the following members.
Properties
Name | Description
ColumnInsideWall |  One element is completely inside another.
CopingWarningExtension |  Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.
CopingWarningIgnored |  Cuts on concrete members are ignored.
CopingWarningMedium |  Coping applied, but only in Medium Detail Level.
CopingWarningOffset |  Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters.
StartCutShadowJoin |  Two joined walls are in a position to allow automatic insert copying.
StopCutShadowJoin |  Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.
Top
See Also
Reference
Autodesk.Revit.DB Namespace